# Setup

In [1]:
from piper import piper
from piper.verbs import *
from piper.factory import get_sample_data

piper version 0.0.9, last run: Tuesday, 09 March 2021 20:05:11

# Data

In [2]:
df_a = pd.read_excel('inputs/workbook_f1.xlsx')
head(df_a)

12 rows, 5 columns

,Name,Position,YR Experience,Interview Score,Comments
0,Ahmed,Engineer,3,5.0,Fantastic Preporation
1,Ben,Manager,4,4.5,Very enthusiastic
2,Catherine,Manager,4,3.5,Most Professional Interview
3,Derrick,Janitoral,0,0.0,Technologically Challenged

In [3]:
df_b = pd.read_excel('inputs/workbook_f2.xlsx')
head(df_b)

6 rows, 4 columns

        Name Challenge  Group Interview Score                 Group Comments
0        Ben         A                      5              Kind communicator
1  Catherine         A                      4                 Problem solver
2     Felipe         A                      5                         Leader
3    Gabriel         B                      3  Smart at approaching problems

# Join types

In [4]:
join_types = [inner_join, left_join, right_join, outer_join]

for f in join_types:
    display(head(df_a.pipe(f, df_b, on='Name'), 4).style.highlight_null('yellow'))

5 rows, 8 columns

12 rows, 8 columns

6 rows, 8 columns

13 rows, 8 columns